node {
  name: "placeholders/nn_x"
  op: "Placeholder"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 144
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "placeholders/nn_q_t"
  op: "Placeholder"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "placeholders/nn_actions"
  op: "Placeholder"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "placeholders/nn_rewards"
  op: "Placeholder"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "placeholders/nn_terminals"
  op: "Placeholder"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "world_1/weight"
  op: "Variable"
  device: "/job:ps/task:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 144
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 144
        }
        dim {
          size: 1000
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "world_1/weight/Initializer/truncated_normal/shape"
  op: "Const"
  device: "/job:ps/task:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@world_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\220\000\000\000\350\003\000\000"
      }
    }
  }
}
node {
  name: "world_1/weight/Initializer/truncated_normal/mean"
  op: "Const"
  device: "/job:ps/task:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@world_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "world_1/weight/Initializer/truncated_normal/stddev"
  op: "Const"
  device: "/job:ps/task:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@world_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "world_1/weight/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "world_1/weight/Initializer/truncated_normal/shape"
  device: "/job:ps/task:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@world_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 144
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "world_1/weight/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "world_1/weight/Initializer/truncated_normal/TruncatedNormal"
  input: "world_1/weight/Initializer/truncated_normal/stddev"
  device: "/job:ps/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@world_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 144
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
}
node {
  name: "world_1/weight/Initializer/truncated_normal"
  op: "Add"
  input: "world_1/weight/Initializer/truncated_normal/mul"
  input: "world_1/weight/Initializer/truncated_normal/mean"
  device: "/job:ps/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@world_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 144
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
}
node {
  name: "world_1/weight/Assign"
  op: "Assign"
  input: "world_1/weight"
  input: "world_1/weight/Initializer/truncated_normal"
  device: "/job:ps/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@world_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 144
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "world_1/weight/read"
  op: "Identity"
  input: "world_1/weight"
  device: "/job:ps/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@world_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 144
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
}
node {
  name: "world_1/bias"
  op: "Variable"
  device: "/job:ps/task:1"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1000
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "world_1/bias/Initializer/Const"
  op: "Const"
  device: "/job:ps/task:1"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@world_1/bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1000
          }
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "world_1/bias/Assign"
  op: "Assign"
  input: "world_1/bias"
  input: "world_1/bias/Initializer/Const"
  device: "/job:ps/task:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@world_1/bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "world_1/bias/read"
  op: "Identity"
  input: "world_1/bias"
  device: "/job:ps/task:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@world_1/bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
        }
      }
    }
  }
}
node {
  name: "world_1/MatMul"
  op: "MatMul"
  input: "placeholders/nn_x"
  input: "world_1/weight/read"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "world_1/Add"
  op: "Add"
  input: "world_1/MatMul"
  input: "world_1/bias/read"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
}
node {
  name: "world_1/output"
  op: "Relu"
  input: "world_1/Add"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
}
node {
  name: "task_1/weight"
  op: "Variable"
  device: "/job:ps/task:2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1000
        }
        dim {
          size: 1000
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "task_1/weight/Initializer/truncated_normal/shape"
  op: "Const"
  device: "/job:ps/task:2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@task_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\350\003\000\000\350\003\000\000"
      }
    }
  }
}
node {
  name: "task_1/weight/Initializer/truncated_normal/mean"
  op: "Const"
  device: "/job:ps/task:2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@task_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "task_1/weight/Initializer/truncated_normal/stddev"
  op: "Const"
  device: "/job:ps/task:2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@task_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "task_1/weight/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "task_1/weight/Initializer/truncated_normal/shape"
  device: "/job:ps/task:2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@task_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "task_1/weight/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "task_1/weight/Initializer/truncated_normal/TruncatedNormal"
  input: "task_1/weight/Initializer/truncated_normal/stddev"
  device: "/job:ps/task:2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@task_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
}
node {
  name: "task_1/weight/Initializer/truncated_normal"
  op: "Add"
  input: "task_1/weight/Initializer/truncated_normal/mul"
  input: "task_1/weight/Initializer/truncated_normal/mean"
  device: "/job:ps/task:2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@task_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
}
node {
  name: "task_1/weight/Assign"
  op: "Assign"
  input: "task_1/weight"
  input: "task_1/weight/Initializer/truncated_normal"
  device: "/job:ps/task:2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@task_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "task_1/weight/read"
  op: "Identity"
  input: "task_1/weight"
  device: "/job:ps/task:2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@task_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
}
node {
  name: "task_1/bias"
  op: "Variable"
  device: "/job:ps/task:3"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1000
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "task_1/bias/Initializer/Const"
  op: "Const"
  device: "/job:ps/task:3"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@task_1/bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1000
          }
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "task_1/bias/Assign"
  op: "Assign"
  input: "task_1/bias"
  input: "task_1/bias/Initializer/Const"
  device: "/job:ps/task:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@task_1/bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "task_1/bias/read"
  op: "Identity"
  input: "task_1/bias"
  device: "/job:ps/task:3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@task_1/bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
        }
      }
    }
  }
}
node {
  name: "task_1/MatMul"
  op: "MatMul"
  input: "world_1/output"
  input: "task_1/weight/read"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "task_1/Add"
  op: "Add"
  input: "task_1/MatMul"
  input: "task_1/bias/read"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
}
node {
  name: "task_1/output"
  op: "Relu"
  input: "task_1/Add"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1000
          }
        }
      }
    }
  }
}
node {
  name: "agent_1/weight"
  op: "Variable"
  device: "/job:ps/task:4"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1000
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "agent_1/weight/Initializer/truncated_normal/shape"
  op: "Const"
  device: "/job:ps/task:4"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\350\003\000\000\004\000\000\000"
      }
    }
  }
}
node {
  name: "agent_1/weight/Initializer/truncated_normal/mean"
  op: "Const"
  device: "/job:ps/task:4"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "agent_1/weight/Initializer/truncated_normal/stddev"
  op: "Const"
  device: "/job:ps/task:4"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "agent_1/weight/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "agent_1/weight/Initializer/truncated_normal/shape"
  device: "/job:ps/task:4"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "agent_1/weight/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "agent_1/weight/Initializer/truncated_normal/TruncatedNormal"
  input: "agent_1/weight/Initializer/truncated_normal/stddev"
  device: "/job:ps/task:4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "agent_1/weight/Initializer/truncated_normal"
  op: "Add"
  input: "agent_1/weight/Initializer/truncated_normal/mul"
  input: "agent_1/weight/Initializer/truncated_normal/mean"
  device: "/job:ps/task:4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "agent_1/weight/Assign"
  op: "Assign"
  input: "agent_1/weight"
  input: "agent_1/weight/Initializer/truncated_normal"
  device: "/job:ps/task:4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "agent_1/weight/read"
  op: "Identity"
  input: "agent_1/weight"
  device: "/job:ps/task:4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent_1/weight"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "agent_1/bias"
  op: "Variable"
  device: "/job:ps/task:5"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "agent_1/bias/Initializer/Const"
  op: "Const"
  device: "/job:ps/task:5"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent_1/bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 4
          }
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "agent_1/bias/Assign"
  op: "Assign"
  input: "agent_1/bias"
  input: "agent_1/bias/Initializer/Const"
  device: "/job:ps/task:5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent_1/bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "agent_1/bias/read"
  op: "Identity"
  input: "agent_1/bias"
  device: "/job:ps/task:5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@agent_1/bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "agent_1/MatMul"
  op: "MatMul"
  input: "task_1/output"
  input: "agent_1/weight/read"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "agent_1/output_aka_y"
  op: "Add"
  input: "agent_1/MatMul"
  input: "agent_1/bias/read"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/discount"
  op: "Const"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.899999976158
      }
    }
  }
}
node {
  name: "optimizer/sub/x"
  op: "Const"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "optimizer/sub"
  op: "Sub"
  input: "optimizer/sub/x"
  input: "placeholders/nn_terminals"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/Mul"
  op: "Mul"
  input: "optimizer/discount"
  input: "placeholders/nn_q_t"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/Mul_1"
  op: "Mul"
  input: "optimizer/sub"
  input: "optimizer/Mul"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/true_y"
  op: "Add"
  input: "placeholders/nn_rewards"
  input: "optimizer/Mul_1"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/Mul_2"
  op: "Mul"
  input: "agent_1/output_aka_y"
  input: "placeholders/nn_actions"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/q_pred/reduction_indices"
  op: "Const"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "optimizer/q_pred"
  op: "Sum"
  input: "optimizer/Mul_2"
  input: "optimizer/q_pred/reduction_indices"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "optimizer/Sub"
  op: "Sub"
  input: "optimizer/true_y"
  input: "optimizer/q_pred"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/Pow/y"
  op: "Const"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 2.0
      }
    }
  }
}
node {
  name: "optimizer/Pow"
  op: "Pow"
  input: "optimizer/Sub"
  input: "optimizer/Pow/y"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/Rank"
  op: "Rank"
  input: "optimizer/Pow"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "optimizer/range/start"
  op: "Const"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "optimizer/range/delta"
  op: "Const"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "optimizer/range"
  op: "Range"
  input: "optimizer/range/start"
  input: "optimizer/Rank"
  input: "optimizer/range/delta"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/cost"
  op: "Sum"
  input: "optimizer/Pow"
  input: "optimizer/range"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "optimizer/gradients/Shape"
  op: "Shape"
  input: "optimizer/cost"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/Const"
  op: "Const"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "optimizer/gradients/Fill"
  op: "Fill"
  input: "optimizer/gradients/Shape"
  input: "optimizer/gradients/Const"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/cost_grad/Shape"
  op: "Shape"
  input: "optimizer/Pow"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/cost_grad/Size"
  op: "Size"
  input: "optimizer/gradients/optimizer/cost_grad/Shape"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/cost_grad/add"
  op: "Add"
  input: "optimizer/range"
  input: "optimizer/gradients/optimizer/cost_grad/Size"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/cost_grad/mod"
  op: "Mod"
  input: "optimizer/gradients/optimizer/cost_grad/add"
  input: "optimizer/gradients/optimizer/cost_grad/Size"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/cost_grad/Shape_1"
  op: "Shape"
  input: "optimizer/gradients/optimizer/cost_grad/mod"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/cost_grad/range/start"
  op: "Const"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/cost_grad/range/delta"
  op: "Const"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/cost_grad/range"
  op: "Range"
  input: "optimizer/gradients/optimizer/cost_grad/range/start"
  input: "optimizer/gradients/optimizer/cost_grad/Size"
  input: "optimizer/gradients/optimizer/cost_grad/range/delta"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/cost_grad/Fill/value"
  op: "Const"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/cost_grad/Fill"
  op: "Fill"
  input: "optimizer/gradients/optimizer/cost_grad/Shape_1"
  input: "optimizer/gradients/optimizer/cost_grad/Fill/value"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/cost_grad/DynamicStitch"
  op: "DynamicStitch"
  input: "optimizer/gradients/optimizer/cost_grad/range"
  input: "optimizer/gradients/optimizer/cost_grad/mod"
  input: "optimizer/gradients/optimizer/cost_grad/Shape"
  input: "optimizer/gradients/optimizer/cost_grad/Fill"
  device: "/job:worker"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/cost_grad/Maximum/y"
  op: "Const"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/cost_grad/Maximum"
  op: "Maximum"
  input: "optimizer/gradients/optimizer/cost_grad/DynamicStitch"
  input: "optimizer/gradients/optimizer/cost_grad/Maximum/y"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/cost_grad/floordiv"
  op: "Div"
  input: "optimizer/gradients/optimizer/cost_grad/Shape"
  input: "optimizer/gradients/optimizer/cost_grad/Maximum"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/cost_grad/Reshape"
  op: "Reshape"
  input: "optimizer/gradients/Fill"
  input: "optimizer/gradients/optimizer/cost_grad/DynamicStitch"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/cost_grad/Tile"
  op: "Tile"
  input: "optimizer/gradients/optimizer/cost_grad/Reshape"
  input: "optimizer/gradients/optimizer/cost_grad/floordiv"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/Shape"
  op: "Shape"
  input: "optimizer/Sub"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/Shape_1"
  op: "Shape"
  input: "optimizer/Pow/y"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "optimizer/gradients/optimizer/Pow_grad/Shape"
  input: "optimizer/gradients/optimizer/Pow_grad/Shape_1"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/mul"
  op: "Mul"
  input: "optimizer/gradients/optimizer/cost_grad/Tile"
  input: "optimizer/Pow/y"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/sub/y"
  op: "Const"
  device: "/job:worker"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/sub"
  op: "Sub"
  input: "optimizer/Pow/y"
  input: "optimizer/gradients/optimizer/Pow_grad/sub/y"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/Pow"
  op: "Pow"
  input: "optimizer/Sub"
  input: "optimizer/gradients/optimizer/Pow_grad/sub"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/mul_1"
  op: "Mul"
  input: "optimizer/gradients/optimizer/Pow_grad/mul"
  input: "optimizer/gradients/optimizer/Pow_grad/Pow"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/Sum"
  op: "Sum"
  input: "optimizer/gradients/optimizer/Pow_grad/mul_1"
  input: "optimizer/gradients/optimizer/Pow_grad/BroadcastGradientArgs"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/Reshape"
  op: "Reshape"
  input: "optimizer/gradients/optimizer/Pow_grad/Sum"
  input: "optimizer/gradients/optimizer/Pow_grad/Shape"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/mul_2"
  op: "Mul"
  input: "optimizer/gradients/optimizer/cost_grad/Tile"
  input: "optimizer/Pow"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/Log"
  op: "Log"
  input: "optimizer/Sub"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/mul_3"
  op: "Mul"
  input: "optimizer/gradients/optimizer/Pow_grad/mul_2"
  input: "optimizer/gradients/optimizer/Pow_grad/Log"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/Sum_1"
  op: "Sum"
  input: "optimizer/gradients/optimizer/Pow_grad/mul_3"
  input: "optimizer/gradients/optimizer/Pow_grad/BroadcastGradientArgs:1"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/Reshape_1"
  op: "Reshape"
  input: "optimizer/gradients/optimizer/Pow_grad/Sum_1"
  input: "optimizer/gradients/optimizer/Pow_grad/Shape_1"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/tuple/group_deps"
  op: "NoOp"
  input: "^optimizer/gradients/optimizer/Pow_grad/Reshape"
  input: "^optimizer/gradients/optimizer/Pow_grad/Reshape_1"
  device: "/job:worker"
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/tuple/control_dependency"
  op: "Identity"
  input: "optimizer/gradients/optimizer/Pow_grad/Reshape"
  input: "^optimizer/gradients/optimizer/Pow_grad/tuple/group_deps"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@optimizer/gradients/optimizer/Pow_grad/Reshape"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "optimizer/gradients/optimizer/Pow_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "optimizer/gradients/optimizer/Pow_grad/Reshape_1"
  input: "^optimizer/gradients/optimizer/Pow_grad/tuple/group_deps"
  device: "/job:worker"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
